[
    {
        "image": "assets/img/700x1000/TuneCrafter.webp",
        "title": {
            "name": "Tune Crafter",
            "href": "https://scavalleroo.github.io/Tune-Crafter/"
        },
        "location": "Université Paris-Saclay, Paris",
        "timeframe": "September 2023 - October 2023",
        "designConcept": "Tune Crafter is a web application that allows people to create new music beats and control the music flow with simple hand gestures.",
        "coverImage": "assets/img/covers/1920x800/TuneCrafter.png",
        "descriptions": [
            {
                "title": "The Challenge",
                "description": "The challenge assigned by the course Advance Programming of Interactive System was to use cutting-edge technologies to create innovative user interactions within an application in a 4 week timeframe.",
                "list": null,
                "image": null,
                "video": null
            },
            {
                "title": "The Solution",
                "description": "We successfully created a web application that runs on Chromium based browsers and on devices that are equipped with a webcam and a microphone that allows people to play with the music flow and create beats using simple hand gestures and voice commands. We also developed a smartwatch app that communicates the heartbeat and receives tactile feedback of the music tempo directly on the watch.",
                "list": null,
                "image": null,
                "video": null
            },
            {
                "title": "My Role & Contributions",
                "description": "UI Designer and Developer",
                "list": {
                    "type": "bullet",
                    "points": [
                        "Drawing sketches of the applications and defining the features of the application.",
                        "Defining the architecture of the application after conducting a technology research benchmarked of different tech stack and libraries.",
                        "Coding key features of the application such as user interaction through gesture recognition and the music flow control and the UI of the application.",
                        "Creating reports of the app performance with Google Analytics that will drive changes based on the user behaviours."
                    ]
                },
                "image": null,
                "video": "assets/img/TuneCrafter/TuneCrafterFinal.mov"
            },
            {
                "title": "Design Flow",
                "description": null,
                "list": {
                    "type": "numbers",
                    "points": [
                        "Defining the topic: Thanks to brainstorming sessions, we decided to focus on creating music beats and controlling the music flow.",
                        "Cutting edge technologies: To define the architecture of the app we based our decision mainly on the performance, the adaptability with other libraries, the community and the documentation of the technology. We took the path of a computer vision and speech recognition app that can be used from Desktop and Smartphones and that also connects with Android smartwatches.",
                        "Unexplored and innovative application: Combine the hand gestures recognition with the music control and beats creation and receiving live tactile feedback on the watch."
                    ]
                },
                "image": null,
                "video": null
            },
            {
                "title": "Application Design",
                "description": "The initial design phase focused on creating a UI and interaction system for a music application using hand gestures and speech recognition. We explored two primary design approaches:",
                "list": {
                    "types": "numbers",
                    "points": [
                        "DJ Console Interface: We considered a familiar layout resembling a DJ console, which would leverage users' existing mental models of music creation tools.",
                        "Innovative Interaction Design: Our goal was to enable users to create beats through simple, intuitive gestures like a two-finger touch. After three low-fidelity prototype iterations, we finalised the UI design."
                    ]
                },
                "image": null,
                "video": null
            },
            {
                "title": "Gesture Mapping and Implementation",
                "description": "We utilised the Mediapipe API to analyse hand tracking capabilities and selected specific gestures for action mapping. The primary challenge was designing a system that could initiate actions from any user position. Our solution was implementing a finite state machine that dynamically interprets gesture sequences to trigger specific actions.",
                "list": {
                    "type": "bullet",
                    "points": [
                        "Standard Mode: 4 drumpad sounds",
                        "Christmas Mode: 4 seasonal-specific sounds",
                        "Piano Mode: 4 piano chords for foundational musical composition"
                    ]
                },
                "image": "assets/img/TuneCrafter/Gestures.png",
                "video": null
            },
            {
                "title": "Learnings",
                "description": null,
                "list": {
                    "type": "bullet",
                    "points": [
                        "Experience with OpenCV, Mediapipe and Webkit libraries for hand gesture and speech recognition.",
                        "Design the architecture of the communication of the Web app with the Smartwatch using network sockets under the same internet connection and exploiting smartwatch features.",
                        "Valuable learning about the usability of and the discoverability of the feature of the application were collected thanks to user feedbacks."
                    ]
                },
                "image": null,
                "video": null
            },
            {
                "title": "Results",
                "description": null,
                "list": {
                    "type": "bullet",
                    "points": [
                        "Web application designed, implemented and lunched in 4 weeks timeframe.",
                        "The “wow effect” of the application created a word of mouth effect that bring 60 new users per month that try the platform.",
                        "Development of personal skills: User Interactions design, Web and Smartwatch development, Application tracking and User testing.",
                        "Live demo at Université Paris-Saclay.",
                        "Live demo and interview at Good Soup Media channel"
                    ]
                },
                "image": "assets/img/TuneCrafter/MobileDesk.png",
                "video": null
            }
        ]
    }
]